{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "signature": {"inputs": {"embedding_input": {"name": "embedding_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "18"}]}}}, "outputs": {"dense_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2000"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "embedding_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "18"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_32", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_33", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_34", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read_2/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_26", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_24", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/embedding/Cast", "op": "Cast", "input": ["embedding_input"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_43", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_32", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_79"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_44", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_33", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_80"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_45", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_34", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_81"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_37", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_26", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_73"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_24", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_71"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/sequential/embedding/Cast", "StatefulPartitionedCall/sequential/embedding/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/embedding/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/embedding/embedding_lookup", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/Shape", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros/packed/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_31", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/Shape", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "StatefulPartitionedCall/sequential/lstm/zeros_1/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros/packed", "StatefulPartitionedCall/sequential/lstm/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_31", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_78"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_30", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/zeros_1"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_28", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/zeros"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_27", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_41", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_30", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_77"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_29", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_76"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_39", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_28", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_75"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_38", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_27", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_74"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/cond/_22/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_37", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_41", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_35"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_46", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/cond/_22/while/Less"]}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_13_switch/_52", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_46"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_54", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_46"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_14_switch/_55", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_43", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_46"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_12_switch/_51", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_39", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_46"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_15_switch/_56", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_44", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_46"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_16_switch/_57", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_45", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_46"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/time_switch/_49", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_37", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_46"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_47", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_35", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_46"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1_switch/_50", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_38", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_46"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_switch/_53", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_41", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_46"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_47:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/exit/_62", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1_switch/_50"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_78", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_54:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_79", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_14_switch/_55:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_80", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_15_switch/_56:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_12_switch/_51:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_15_switch/_56:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_81", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_16_switch/_57:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/input/_98", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/time_switch/_49:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_77", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_switch/_53:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/exit/_62", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_54:1", "Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/input/_98", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/input/_98", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_47:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_14_switch/_55:1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_73", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add_2", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_71", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add_3", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2", "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/MatMul", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense/Relu", "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_16_switch/_57:1"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/split/split_dim", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/dense_1/Sigmoid", "^StatefulPartitionedCall/sequential/embedding/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/Sigmoid_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_13_switch/_52:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/Sigmoid", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/mul", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_76", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add_1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/Sigmoid_2", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_75", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/mul_2", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1_switch/_50:1", "Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/input/_98", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/mul_2"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_74", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/TensorArrayV2Write/TensorListSetItem", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_58"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/Read/ReadVariableOp", "shape": [16, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_1/ReadVariableOp", "shape": [64, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_2/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "shape": [64, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "shape": [24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "shape": [24, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "unknown", "shape": [2000, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/embedding/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add_2/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_23/while/add_3/y", "shape": [], "dtype": "int32"}]}]}